---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ResourceNotFoundException
source: html/2ea3e52a-084e-5722-4b27-7ae8384b7aae.htm
---
# ResourceNotFoundException Methods

Retrieves data needed to serialize the target object.